RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
/*
 * Copyright (c) 2006-2025, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2025-11-07     RealThread   the first version
 */

#ifndef DRV_USB_REGS_H
#define DRV_USB_REGS_H

#include "usb_conf.h"

#define USBHS0 USBHS_BASE
#define USBHS1 (USBHS_BASE + 0x00040000U)

#define USBHS0_REG_BASE USBHS0            /*!< base address of USBHS0 registers */
#define USBHS1_REG_BASE USBHS1            /*!< base address of USBHS1 registers */

/* register definition */

#define USBHS_MAX_TX_FIFOS 16U               /*!< FIFO number */

typedef struct
{
    __IO uint32_t GOTGCS;                           /*!< USB global OTG control and status register       000h */
    __IO uint32_t GOTGINTF;                         /*!< USB global OTG interrupt flag register           004h */
    __IO uint32_t GAHBCS;                           /*!< USB global AHB control and status register       008h */
    __IO uint32_t GUSBCS;                           /*!< USB global USB control and status register       00Ch */
    __IO uint32_t GRSTCTL;                          /*!< USB global reset control register                010h */
    __IO uint32_t GINTF;                            /*!< USB global interrupt flag register               014h */
    __IO uint32_t GINTEN;                           /*!< USB global interrupt enable register             018h */
    __IO uint32_t GRSTATR;                          /*!< USB receive status debug read register           01Ch */
    __IO uint32_t GRSTATP;                          /*!< USB receive status and pop register              020h */
    __IO uint32_t GRFLEN;                           /*!< USB global receive FIFO length register          024h */
    __IO uint32_t DIEP0TFLEN_HNPTFLEN;              /*!< USB device IN endpoint 0/host non-periodic transmit FIFO length register 028h */
    __IO uint32_t HNPTFQSTAT;                       /*!< USB host non-periodic FIFO/queue status register 02Ch */
    uint32_t Reserved30[2];                         /*!< Reserved                                         030h */
    __IO uint32_t GCCFG;                            /*!< USB global core configuration register           038h */
    __IO uint32_t CID;                              /*!< USB core ID register                             03Ch */
    uint32_t Reserved40[5];                         /*!< Reserved                                         040h-053h */
    __IO uint32_t GLPMCFG;                          /*!< LPM configuration register                       54h */
    __IO uint32_t PWRD;                             /*!< power down register                              58h */
    uint32_t Reserved5C;                            /*!< Reserved                                         5Ch */
    __IO uint32_t ADPCTL;                           /*!< ADP control and status register                  60h */
    uint32_t Reserved64[3];                         /*!< Reserved                                         64h-6Fh */
    __IO uint32_t PHYCTL;                           /*!< USBHS PHY control register                       70h */
    uint32_t Reserved74[35];                        /*!< Reserved                                         74h-FFh */
    __IO uint32_t HPTFLEN;                          /*!< USB host periodic transmit FIFO length register  100h */
    __IO uint32_t DIEPTFLEN[15];                    /*!< USB device IN endpoint transmit FIFO length register 104h */
} usb_gr;

typedef struct
{
    __IO uint32_t HCTL;                             /*!< USB host control register                             400h */
    __IO uint32_t HFT;                              /*!< USB host frame interval register                      404h */
    __IO uint32_t HFINFR;                           /*!< USB host frame information remaining register         408h */
    uint32_t Reserved40C;                           /*!< Reserved                                              40Ch */
    __IO uint32_t HPTFQSTAT;                        /*!< USB host periodic transmit FIFO/queue status register 410h */
    __IO uint32_t HACHINT;                          /*!< USB host all channels interrupt register              414h */
    __IO uint32_t HACHINTEN;                        /*!< USB host all channels interrupt enable register       418h */
} usb_hr;

typedef struct
{
    __IO uint32_t HCHCTL;                           /*!< USB host channel control register                     500h */
    __IO uint32_t HCHSTCTL;                         /*!< Reserved                                              504h */
    __IO uint32_t HCHINTF;                          /*!< USB host channel interrupt flag register              508h */
    __IO uint32_t HCHINTEN;                         /*!< USB host channel interrupt enable register            50Ch */
    __IO uint32_t HCHLEN;                           /*!< USB host channel transfer length register             510h */
    __IO uint32_t HCHDMAADDR;                       /*!< USB host channel-x DMA address register               514h*/
    uint32_t Reserved[2];
} usb_pr;

typedef struct
{
    __IO uint32_t DCFG;                             /*!< USB device configuration register                           800h */
    __IO uint32_t DCTL;                             /*!< USB device control register                                 804h */
    __IO uint32_t DSTAT;                            /*!< USB device status register                                  808h */
    uint32_t Reserved0C;                            /*!< Reserved                                                    80Ch */
    __IO uint32_t DIEPINTEN;                        /*!< USB device IN endpoint common interrupt enable register     810h */
    __IO uint32_t DOEPINTEN;                        /*!< USB device OUT endpoint common interrupt enable register    814h */
    __IO uint32_t DAEPINT;                          /*!< USB device all endpoints interrupt register                 818h */
    __IO uint32_t DAEPINTEN;                        /*!< USB device all endpoints interrupt enable register          81Ch */
    uint32_t Reserved20;                            /*!< Reserved                                                    820h */
    uint32_t Reserved24;                            /*!< Reserved                                                    824h */
    __IO uint32_t DVBUSDT;                          /*!< USB device VBUS discharge time register                     828h */
    __IO uint32_t DVBUSPT;                          /*!< USB device VBUS pulsing time register                       82Ch */
    uint32_t Reserved30;                            /*!< Reserved                                                    830h */
    __IO uint32_t DIEPFEINTEN;                      /*!< USB Device IN endpoint FIFO empty interrupt enable register 834h */
    __IO uint32_t DEP1INT;                          /*!< USB device endpoint 1 interrupt register                    838h */
    __IO uint32_t DEP1INTEN;                        /*!< USB device endpoint 1 interrupt enable register             83Ch */
    uint32_t Reserved40;                            /*!< Reserved                                                    840h */
    __IO uint32_t DIEP1INTEN;                       /*!< USB device IN endpoint-1 interrupt enable register          844h */
    uint32_t Reserved48[15];                        /*!< Reserved                                                848-880h */
    __IO uint32_t DOEP1INTEN;                       /*!< USB device OUT endpoint-1 interrupt enable register         884h */
} usb_dr;

typedef struct
{
    __IO uint32_t DIEPCTL;                          /*!< USB device IN endpoint control register         900h + (EpNum * 20h) + 00h */
    uint32_t Reserved04;                            /*!< Reserved                                        900h + (EpNum * 20h) + 04h */
    __IO uint32_t DIEPINTF;                         /*!< USB device IN endpoint interrupt flag register  900h + (EpNum * 20h) + 08h */
    uint32_t Reserved0C;                            /*!< Reserved                                        900h + (EpNum * 20h) + 0Ch */
    __IO uint32_t DIEPLEN;                          /*!< USB device IN endpoint transfer length register 900h + (EpNum * 20h) + 10h */
    __IO uint32_t DIEPDMAADDR;                      /*!< Device IN endpoint-x DMA address register       900h + (EpNum * 20h) + 14h */
    __IO uint32_t DIEPTFSTAT;                       /*!< USB device IN endpoint transmit FIFO status register 900h + (EpNum * 20h) + 18h */
} usb_erin;

typedef struct
{
    __IO uint32_t DOEPCTL;                          /*!< USB device IN endpoint control register         B00h + (EpNum * 20h) + 00h */
    uint32_t Reserved04;                            /*!< Reserved                                        B00h + (EpNum * 20h) + 04h */
    __IO uint32_t DOEPINTF;                         /*!< USB device IN endpoint interrupt flag register  B00h + (EpNum * 20h) + 08h */
    uint32_t Reserved0C;                            /*!< Reserved                                        B00h + (EpNum * 20h) + 0Ch */
    __IO uint32_t DOEPLEN;                          /*!< USB device IN endpoint transfer length register B00h + (EpNum * 20h) + 10h */
    __IO uint32_t DOEPDMAADDR;                      /*!< Device OUT endpoint-x DMA address register      B00h + (EpNum * 20h) + 0Ch */
} usb_erout;

typedef struct _usb_regs
{
    usb_gr *gr;                               /*!< USBHS global registers */
    usb_dr *dr;                               /*!< device control and status registers */
    usb_hr *hr;                               /*!< host control and status registers */
    usb_erin *er_in[8];                         /*!< USB device IN endpoint register */
    usb_erout *er_out[8];                        /*!< USB device OUT endpoint register */
    usb_pr *pr[16];                           /*!< USB Host channel-x control register */

    __IO uint32_t *HPCS;                        /*!< USB host port control and status register */
    __IO uint32_t *DFIFO[USBHS_MAX_TX_FIFOS];
    __IO uint32_t *PWRCLKCTL;                   /*!< USB power and clock control register */
} usb_core_regs;

/* global OTG control and status register bits definitions */
#define GOTGCS_OV     BIT(20)             /*!< select OTG version */
#define GOTGCS_BSV    BIT(19)             /*!< B-Session Valid */
#define GOTGCS_ASV    BIT(18)             /*!< A-session valid */
#define GOTGCS_DI     BIT(17)             /*!< debounce interval */
#define GOTGCS_IDPS   BIT(16)             /*!< id pin status */
#define GOTGCS_EHE    BIT(12)             /*!< embedded host enable */
#define GOTGCS_DHNPEN BIT(11)             /*!< device HNP enable */
#define GOTGCS_HHNPEN BIT(10)             /*!< host HNP enable */
#define GOTGCS_HNPREQ BIT(9)              /*!< HNP request */
#define GOTGCS_HNPS   BIT(8)              /*!< HNP successes */
#define GOTGCS_BVOV   BIT(7)              /*!< override value of B-peripheral session valid */
#define GOTGCS_BVOE   BIT(6)              /*!< override enable of B-peripheral session valid */
#define GOTGCS_AVOV   BIT(5)              /*!< override value of A-peripheral session valid */
#define GOTGCS_AVOE   BIT(4)              /*!< override enable of A-peripheral session valid */
#define GOTGCS_VOV    BIT(3)              /*!< override value of VBUS valid */
#define GOTGCS_VOE    BIT(2)              /*!< override enable of VBUS valid */
#define GOTGCS_SRPREQ BIT(1)              /*!< SRP request */
#define GOTGCS_SRPS   BIT(0)              /*!< SRP successes */

/* global OTG interrupt flag register bits definitions */
#define GOTGINTF_IDCHG  BIT(20)             /*!< ID input change */
#define GOTGINTF_DF     BIT(19)             /*!< debounce finish */
#define GOTGINTF_ADTO   BIT(18)             /*!< A-device timeout */
#define GOTGINTF_HNPDET BIT(17)             /*!< host negotiation request detected */
#define GOTGINTF_HNPEND BIT(9)              /*!< HNP end */
#define GOTGINTF_SRPEND BIT(8)              /*!< SRP end */
#define GOTGINTF_SESEND BIT(2)              /*!< session end */

/* global AHB control and status register bits definitions */
#define GAHBCS_PTXFTH BIT(8)              /*!< periodic Tx FIFO threshold */
#define GAHBCS_TXFTH  BIT(7)              /*!< tx FIFO threshold */
#define GAHBCS_DMAEN  BIT(5)              /*!< DMA function Enable */
#define GAHBCS_BURST  BITS(1, 4)           /*!< the AHB burst type used by DMA */
#define GAHBCS_GINTEN BIT(0)              /*!< global interrupt enable */

/* global USB control and status register bits definitions */
#define GUSBCS_FDM       BIT(30)             /*!< force device mode */
#define GUSBCS_FHM       BIT(29)             /*!< force host mode */
#define GUSBCS_ULPIEOI   BIT(21)             /*!< ULPI external over-current indicator */
#define GUSBCS_ULPIEVD   BIT(20)             /*!< ULPI external VBUS driver */
#define GUSBCS_UTT       BITS(10, 13)         /*!< USB turnaround time */
#define GUSBCS_HNPCEN    BIT(9)              /*!< HNP capability enable */
#define GUSBCS_SRPCEN    BIT(8)              /*!< SRP capability enable */
#define GUSBCS_EMBPHY_FS BIT(6)              /*!< embedded FS PHY selected */
#define GUSBCS_EMBPHY_HS BIT(5)              /*!< embedded HS PHY selected */
#define GUSBCS_HS_CUR_FE BIT(4)              /*!< HS current software enable */
#define GUSBCS_TOC       BITS(0, 2)           /*!< timeout calibration */

/* global reset control register bits definitions */
#define GRSTCTL_DMAIDL BIT(31)             /*!< DMA idle state */
#define GRSTCTL_DMABSY BIT(30)             /*!< DMA busy */
#define GRSTCTL_TXFNUM BITS(6, 10)          /*!< tx FIFO number */
#define GRSTCTL_TXFF   BIT(5)              /*!< tx FIFO flush */
#define GRSTCTL_RXFF   BIT(4)              /*!< rx FIFO flush */
#define GRSTCTL_HFCRST BIT(2)              /*!< host frame counter reset */
#define GRSTCTL_HCSRST BIT(1)              /*!< HCLK soft reset */
#define GRSTCTL_CSRST  BIT(0)              /*!< core soft reset */

