RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
/* global interrupt flag register bits definitions */
#define GINTF_WKUPIF   BIT(31)             /*!< wakeup interrupt flag */
#define GINTF_SESIF    BIT(30)             /*!< session interrupt flag */
#define GINTF_DISCIF   BIT(29)             /*!< disconnect interrupt flag */
#define GINTF_IDPSC    BIT(28)             /*!< id pin status change */
#define GINTF_LPMIF    BIT(27)             /*!< LPM interrupt flag */
#define GINTF_PTXFEIF  BIT(26)             /*!< periodic tx FIFO empty interrupt flag */
#define GINTF_HCIF     BIT(25)             /*!< host channels interrupt flag */
#define GINTF_HPIF     BIT(24)             /*!< host port interrupt flag */
#define GINTF_PXNCIF   BIT(21)             /*!< periodic transfer not complete interrupt flag */
#define GINTF_ISOONCIF BIT(21)             /*!< isochronous OUT transfer not complete interrupt flag */
#define GINTF_ISOINCIF BIT(20)             /*!< isochronous IN transfer not complete interrupt flag */
#define GINTF_OEPIF    BIT(19)             /*!< OUT endpoint interrupt flag */
#define GINTF_IEPIF    BIT(18)             /*!< IN endpoint interrupt flag */
#define GINTF_EOPFIF   BIT(15)             /*!< end of periodic frame interrupt flag */
#define GINTF_ISOOPDIF BIT(14)             /*!< isochronous OUT packet dropped interrupt flag */
#define GINTF_ENUMFIF  BIT(13)             /*!< enumeration finished */
#define GINTF_RST      BIT(12)             /*!< USB reset */
#define GINTF_SP       BIT(11)             /*!< USB suspend */
#define GINTF_ESP      BIT(10)             /*!< early suspend */
#define GINTF_GONAK    BIT(7)              /*!< global OUT NAK effective */
#define GINTF_GNPINAK  BIT(6)              /*!< global IN non-periodic NAK effective */
#define GINTF_NPTXFEIF BIT(5)              /*!< non-periodic tx FIFO empty interrupt flag */
#define GINTF_RXFNEIF  BIT(4)              /*!< rx FIFO non-empty interrupt flag */
#define GINTF_SOF      BIT(3)              /*!< start of frame */
#define GINTF_OTGIF    BIT(2)              /*!< OTG interrupt flag */
#define GINTF_MFIF     BIT(1)              /*!< mode fault interrupt flag */
#define GINTF_COPM     BIT(0)              /*!< current operation mode */

/* global interrupt enable register bits definitions */
#define GINTEN_WKUPIE    BIT(31)             /*!< wakeup interrupt enable */
#define GINTEN_SESIE     BIT(30)             /*!< session interrupt enable */
#define GINTEN_DISCIE    BIT(29)             /*!< disconnect interrupt enable */
#define GINTEN_IDPSCIE   BIT(28)             /*!< id pin status change interrupt enable */
#define GINTEN_LPMIE     BIT(27)             /*!< LPM interrupt enable */
#define GINTEN_PTXFEIE   BIT(26)             /*!< periodic tx FIFO empty interrupt enable */
#define GINTEN_HCIE      BIT(25)             /*!< host channels interrupt enable */
#define GINTEN_HPIE      BIT(24)             /*!< host port interrupt enable */
#define GINTEN_IPXIE     BIT(21)             /*!< periodic transfer not complete interrupt enable */
#define GINTEN_ISOONCIE  BIT(21)             /*!< isochronous OUT transfer not complete interrupt enable */
#define GINTEN_ISOINCIE  BIT(20)             /*!< isochronous IN transfer not complete interrupt enable */
#define GINTEN_OEPIE     BIT(19)             /*!< OUT endpoints interrupt enable */
#define GINTEN_IEPIE     BIT(18)             /*!< IN endpoints interrupt enable */
#define GINTEN_EOPFIE    BIT(15)             /*!< end of periodic frame interrupt enable */
#define GINTEN_ISOOPDIE  BIT(14)             /*!< isochronous OUT packet dropped interrupt enable */
#define GINTEN_ENUMFIE   BIT(13)             /*!< enumeration finish enable */
#define GINTEN_RSTIE     BIT(12)             /*!< USB reset interrupt enable */
#define GINTEN_SPIE      BIT(11)             /*!< USB suspend interrupt enable */
#define GINTEN_ESPIE     BIT(10)             /*!< early suspend interrupt enable */
#define GINTEN_GONAKIE   BIT(7)              /*!< global OUT NAK effective interrupt enable */
#define GINTEN_GNPINAKIE BIT(6)              /*!< global non-periodic IN NAK effective interrupt enable */
#define GINTEN_NPTXFEIE  BIT(5)              /*!< non-periodic Tx FIFO empty interrupt enable */
#define GINTEN_RXFNEIE   BIT(4)              /*!< receive FIFO non-empty interrupt enable */
#define GINTEN_SOFIE     BIT(3)              /*!< start of frame interrupt enable */
#define GINTEN_OTGIE     BIT(2)              /*!< OTG interrupt enable */
#define GINTEN_MFIE      BIT(1)              /*!< mode fault interrupt enable */

/* global receive status read and pop register bits definitions */
#define GRSTATRP_RPCKST BITS(17, 20)         /*!< received packet status */
#define GRSTATRP_DPID   BITS(15, 16)         /*!< data PID */
#define GRSTATRP_BCOUNT BITS(4, 14)          /*!< byte count */
#define GRSTATRP_CNUM   BITS(0, 3)           /*!< channel number */
#define GRSTATRP_EPNUM  BITS(0, 3)           /*!< endpoint number */

/* global receive FIFO length register bits definitions */
#define GRFLEN_RXFD BITS(0, 15)          /*!< rx FIFO depth */

/* host non-periodic transmit FIFO length register bits definitions */
#define HNPTFLEN_HNPTXFD   BITS(16, 31)         /*!< non-periodic Tx FIFO depth */
#define HNPTFLEN_HNPTXRSAR BITS(0, 15)          /*!< non-periodic Tx RAM start address */

/* USB IN endpoint 0 transmit FIFO length register bits definitions */
#define DIEP0TFLEN_IEP0TXFD   BITS(16, 31)         /*!< IN Endpoint 0 Tx FIFO depth */
#define DIEP0TFLEN_IEP0TXRSAR BITS(0, 15)          /*!< IN Endpoint 0 TX RAM start address */

/* host non-periodic transmit FIFO/queue status register bits definitions */
#define HNPTFQSTAT_NPTXRQTOP BITS(24, 30)         /*!< top entry of the non-periodic Tx request queue */
#define HNPTFQSTAT_NPTXRQS   BITS(16, 23)         /*!< non-periodic Tx request queue space */
#define HNPTFQSTAT_NPTXFS    BITS(0, 15)          /*!< non-periodic Tx FIFO space */
#define HNPTFQSTAT_CNUM      BITS(27, 30)         /*!< channel number*/
#define HNPTFQSTAT_EPNUM     BITS(27, 30)         /*!< endpoint number */
#define HNPTFQSTAT_TYPE      BITS(25, 26)         /*!< token type */
#define HNPTFQSTAT_TMF       BIT(24)             /*!< terminate flag */

/* global core configuration register bits definitions */
#define GCCFG_VDEN   BIT(21)             /*!< enable of VBUS sensing comparator to detect VBUS valid */
#define GCCFG_SOFOEN BIT(20)             /*!< SOF output enable */
#define GCCFG_PWRON  BIT(16)             /*!< power on */
#define GCCFG_SDMEN  BIT(15)             /*!< secondary detection mode enable */
#define GCCFG_PEMEN  BIT(14)             /*!< primary detection mode enable */
#define GCCFG_DCDEN  BIT(13)             /*!< data connect detection mode enable */
#define GCCFG_BCDEN  BIT(12)             /*!< battery charging detection enable */
#define GCCFG_PS2F   BIT(3)              /*!< PS2 detection status */
#define GCCFG_SDF    BIT(2)              /*!< secondary detection status */
#define GCCFG_PDF    BIT(1)              /*!< primary detection status */
#define GCCFG_DCDF   BIT(0)              /*!< battery connect detection status */

/* core ID register bits definitions */
#define CID_CID BITS(0, 31)          /*!< core ID */

/* global core LPM configuration register bits definitions */
#define GLPMCFG_BESLEN  BIT(28)             /*!< LPM Errata selection enable */
#define GLPMCFG_LPMRCS  BITS(25, 27)         /*!< LPM retry count status */
#define GLPMCFG_LPMSND  BIT(24)             /*!< send LPM transaction */
#define GLPMCFG_LPMRC   BITS(21, 23)         /*!< LPM retry count */
#define GLPMCFG_LPMCHI  BITS(17, 20)         /*!< channel number index */
#define GLPMCFG_RSOK    BIT(16)             /*!< Resume can be sent after sleep state */
#define GLPMCFG_LPMSLPS BIT(15)             /*!< sleep status */
#define GLPMCFG_LPMRSP  BITS(13, 14)         /*!< response of LPM */
#define GLPMCFG_DSEN    BIT(12)             /*!< deep sleep enable */
#define GLPMCFG_BESLTH  BITS(8, 11)          /*!< BESL threshold */
#define GLPMCFG_SSEN    BIT(7)              /*!< shallow sleep enable */
#define GLPMCFG_REW     BIT(6)              /*!< bRemoteWake value */
#define GLPMCFG_BESL    BITS(2, 5)           /*!< best effort service latency */
#define GLPMCFG_ACKLPM  BIT(1)              /*!< ACK in LPM transaction enable */
#define GLPMCFG_LPMEN   BIT(0)              /*!< LPM enable */

