RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
/* power down register bits definition */
#define PWRD_ADPF   BIT(23)             /*!< ADP event interrupt flag */
#define PWRD_ADPMEN BIT(0)              /*!< ADP module enable */

/* ADP control and status register bits definition */
#define ADPCTL_RWR     BITS(27, 28)         /*!< read and write request */
#define ADPCTL_ADPTFM  BIT(26)             /*!< the mask of ADP timeout interrupt flag */
#define ADPCTL_ADPSNFM BIT(25)             /*!< the mask of ADP sense interrupt flag */
#define ADPCTL_ADPPRFM BIT(24)             /*!< the mask of ADP probe interrupt flag */
#define ADPCTL_ADPTF   BIT(23)             /*!< ADP timeout interrupt flag */
#define ADPCTL_ADPSNF  BIT(22)             /*!< ADP sense interrupt flag */
#define ADPCTL_ADPPRF  BIT(21)             /*!< ADP probe interrupt flag */
#define ADPCTL_ADPEN   BIT(20)             /*!< ADP enable */
#define ADPCTL_ADPRST  BIT(19)             /*!< ADP reset */
#define ADPCTL_SNEN    BIT(18)             /*!< ADP sense enable */
#define ADPCTL_PREN    BIT(17)             /*!< ADP probe enable */
#define ADPCTL_CHGT    BITS(6, 16)          /*!< the latest time that VBUS ramps from VADPSINK to VADPPRB */
#define ADPCTL_PERPR   BITS(4, 5)           /*!< period of probe */
#define ADPCTL_RESOPR  BITS(2, 3)           /*!< the resolution of CHGT value */
#define ADPCTL_DSCHGPR BITS(0, 1)           /*!< Time of probe discharge */

/* USBHS PHY control register bits definitions */
#define PHYCTL_HS_CALEN        BIT(31)             /*!< HS PHY calibration enable */
#define PHYCTL_HS_CALR         BITS(25, 30)         /*!< HS PHY calibration value */
#define PHYCTL_HS_RCALR        BITS(21, 24)         /*!< HS PHY R calibration value */
#define PHYCTL_SQUECH          BIT(16)             /*!< HS PHY squech flag */
#define PHYCTL_HS_BIST_DONE    BIT(15)             /*!< HS PHY bist finished flag */
#define PHYCTL_HS_BIST_SUCCESS BIT(14)             /*!< HS PHY bist success flag */
#define PHYCTL_HS_BIST_FAIL    BIT(13)             /*!< HS PHY bist fail flag */
#define PHYCTL_HS_BIST_PKT_SEL BITS(11, 12)         /*!< HS PHY bist packet select */
#define PHYCTL_HS_BIST_SEED    BITS(3, 10)          /*!< HS PHY bist seed */
#define PHYCTL_HS_BIST_EN      BIT(2)              /*!< HS PHY bist enable */
#define PHYCTL_HS_BIST_RESET   BIT(1)              /*!< HS PHY bist logic reset */
#define PHYCTL_HS_BIST_START   BIT(0)              /*!< HS PHY bist start */

/* host periodic transmit FIFO length register bits definitions */
#define HPTFLEN_HPTXFD   BITS(16, 31)         /*!< host periodic Tx FIFO depth */
#define HPTFLEN_HPTXFSAR BITS(0, 15)          /*!< host periodic Tx RAM start address */

/* device IN endpoint transmit FIFO length register bits definitions */
#define DIEPTFLEN_IEPTXFD   BITS(16, 31)         /*!< IN endpoint Tx FIFO x depth */
#define DIEPTFLEN_IEPTXRSAR BITS(0, 15)          /*!< IN endpoint FIFOx Tx x RAM start address */

/* host control register bits definitions */
#define HCTL_SPDFSLS BIT(2)              /*!< speed limited to FS and LS */

/* host frame interval register bits definitions */
#define HFT_FRI BITS(0, 15)          /*!< frame interval */

/* host frame information remaining register bits definitions */
#define HFINFR_FRT   BITS(16, 31)         /*!< frame remaining time */
#define HFINFR_FRNUM BITS(0, 15)          /*!< frame number */

/* host periodic transmit FIFO/queue status register bits definitions */
#define HPTFQSTAT_PTXREQT BITS(24, 31)         /*!< top entry of the periodic Tx request queue */
#define HPTFQSTAT_PTXREQS BITS(16, 23)         /*!< periodic Tx request queue space */
#define HPTFQSTAT_PTXFS   BITS(0, 15)          /*!< periodic Tx FIFO space */
#define HPTFQSTAT_OEFRM   BIT(31)             /*!< odd/eveb frame */
#define HPTFQSTAT_CNUM    BITS(27, 30)         /*!< channel number */
#define HPTFQSTAT_EPNUM   BITS(27, 30)         /*!< endpoint number */
#define HPTFQSTAT_TYPE    BITS(25, 26)         /*!< token type */
#define HPTFQSTAT_TMF     BIT(24)             /*!< terminate flag */

#define TFQSTAT_TXFS BITS(0, 15)
#define TFQSTAT_CNUM BITS(27, 30)

/* host all channels interrupt register bits definitions */
#define HACHINT_HACHINT BITS(0, 15)          /*!< host all channel interrupts */

/* host all channels interrupt enable register bits definitions */
#define HACHINTEN_CINTEN BITS(0, 15)          /*!< channel interrupt enable */

/* host port control and status register bits definitions */
#define HPCS_PS    BITS(17, 18)         /*!< port speed */
#define HPCS_PTEST BITS(13, 16)         /*!< port test control */
#define HPCS_PP    BIT(12)             /*!< port power */
#define HPCS_PLST  BITS(10, 11)         /*!< port line status */
#define HPCS_PRST  BIT(8)              /*!< port reset */
#define HPCS_PSP   BIT(7)              /*!< port suspend */
#define HPCS_PREM  BIT(6)              /*!< port resume */
#define HPCS_PEDC  BIT(3)              /*!< port enable/disable change */
#define HPCS_PE    BIT(2)              /*!< port enable */
#define HPCS_PCD   BIT(1)              /*!< port connect detected */
#define HPCS_PCST  BIT(0)              /*!< port connect status */

/* host channel-x control register bits definitions */
#define HCHCTL_CEN    BIT(31)             /*!< channel enable */
#define HCHCTL_CDIS   BIT(30)             /*!< channel disable */
#define HCHCTL_ODDFRM BIT(29)             /*!< odd frame */
#define HCHCTL_DAR    BITS(22, 28)         /*!< device address */
#define HCHCTL_MPC    BITS(20, 21)         /*!< multiple packet count */
#define HCHCTL_EPTYPE BITS(18, 19)         /*!< endpoint type */
#define HCHCTL_LSD    BIT(17)             /*!< low-speed device */
#define HCHCTL_EPDIR  BIT(15)             /*!< endpoint direction */
#define HCHCTL_EPNUM  BITS(11, 14)         /*!< endpoint number */
#define HCHCTL_MPL    BITS(0, 10)          /*!< maximum packet length */

/* host channel-x split transaction register bits definitions */
#define HCHSTCTL_SPLEN  BIT(31)             /*!< enable high-speed split transaction */
#define HCHSTCTL_CSPLT  BIT(16)             /*!< complete-split enable */
#define HCHSTCTL_ISOPCE BITS(14, 15)         /*!< isochronous OUT payload continuation encoding */
#define HCHSTCTL_HADDR  BITS(7, 13)          /*!< HUB address */
#define HCHSTCTL_PADDR  BITS(0, 6)           /*!< port address */

/* host channel-x interrupt flag register bits definitions */
#define HCHINTF_DTER   BIT(10)             /*!< data toggle error */
#define HCHINTF_REQOVR BIT(9)              /*!< request queue overrun */
#define HCHINTF_BBER   BIT(8)              /*!< babble error */
#define HCHINTF_USBER  BIT(7)              /*!< USB bus Error */
#define HCHINTF_NYET   BIT(6)              /*!< NYET */
#define HCHINTF_ACK    BIT(5)              /*!< ACK */
#define HCHINTF_NAK    BIT(4)              /*!< NAK */
#define HCHINTF_STALL  BIT(3)              /*!< STALL */
#define HCHINTF_DMAER  BIT(2)              /*!< DMA error */
#define HCHINTF_CH     BIT(1)              /*!< channel halted */
#define HCHINTF_TF     BIT(0)              /*!< transfer finished */

/* host channel-x interrupt enable register bits definitions */
#define HCHINTEN_DTERIE   BIT(10)             /*!< data toggle error interrupt enable */
#define HCHINTEN_REQOVRIE BIT(9)              /*!< request queue overrun interrupt enable */
#define HCHINTEN_BBERIE   BIT(8)              /*!< babble error interrupt enable */
#define HCHINTEN_USBERIE  BIT(7)              /*!< USB bus error interrupt enable */
#define HCHINTEN_NYETIE   BIT(6)              /*!< NYET interrupt enable */
#define HCHINTEN_ACKIE    BIT(5)              /*!< ACK interrupt enable */
#define HCHINTEN_NAKIE    BIT(4)              /*!< NAK interrupt enable */
#define HCHINTEN_STALLIE  BIT(3)              /*!< STALL interrupt enable */
#define HCHINTEN_DMAERIE  BIT(2)              /*!< DMA error interrupt enable */
#define HCHINTEN_CHIE     BIT(1)              /*!< channel halted interrupt enable */
#define HCHINTEN_TFIE     BIT(0)              /*!< transfer finished interrupt enable */

