RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
/* host channel-x transfer length register bits definitions */
#define HCHLEN_PING BIT(31)             /*!< PING token request */
#define HCHLEN_DPID BITS(29, 30)         /*!< data PID */
#define HCHLEN_PCNT BITS(19, 28)         /*!< packet count */
#define HCHLEN_TLEN BITS(0, 18)          /*!< transfer length */

/* host channel-x DMA address register bits definitions */
#define HCHDMAADDR_DMAADDR BITS(0, 31)          /*!< DMA address */

#define PORT_SPEED(x) (((uint32_t)(x) << 17U) & HPCS_PS) /*!< Port speed */

#define PORT_SPEED_HIGH PORT_SPEED(0U)                             /*!< high speed */
#define PORT_SPEED_FULL PORT_SPEED(1U)                             /*!< full speed */
#define PORT_SPEED_LOW  PORT_SPEED(2U)                             /*!< low speed */

#define PIPE_CTL_DAR(x)    (((uint32_t)(x) << 22U) & HCHCTL_DAR)      /*!< device address */
#define PIPE_CTL_EPTYPE(x) (((uint32_t)(x) << 18U) & HCHCTL_EPTYPE)   /*!< endpoint type */
#define PIPE_CTL_EPNUM(x)  (((uint32_t)(x) << 11U) & HCHCTL_EPNUM)    /*!< endpoint number */
#define PIPE_CTL_EPDIR(x)  (((uint32_t)(x) << 15U) & HCHCTL_EPDIR)    /*!< endpoint direction */
#define PIPE_CTL_EPMPL(x)  (((uint32_t)(x) << 0U) & HCHCTL_MPL)      /*!< maximum packet length */
#define PIPE_CTL_LSD(x)    (((uint32_t)(x) << 17U) & HCHCTL_LSD)      /*!< low-Speed device */

#define PIPE_XFER_PCNT(x) (((uint32_t)(x) << 19U) & HCHLEN_PCNT)     /*!< packet count */
#define PIPE_XFER_DPID(x) (((uint32_t)(x) << 29U) & HCHLEN_DPID)     /*!< data PID */

#define PIPE_DPID_DATA0 PIPE_XFER_DPID(0)                          /*!< DATA0 */
#define PIPE_DPID_DATA1 PIPE_XFER_DPID(2)                          /*!< DATA1 */
#define PIPE_DPID_DATA2 PIPE_XFER_DPID(1)                          /*!< DATA2 */
#define PIPE_DPID_SETUP PIPE_XFER_DPID(3)                          /*!< MDATA (non-control)/SETUP (control) */

extern const uint32_t PIPE_DPID[2];

/* device configuration registers bits definitions */
#define DCFG_EOPFT  BITS(11, 12)         /*!< end of periodic frame time */
#define DCFG_DAR    BITS(4, 10)          /*!< device address */
#define DCFG_NZLSOH BIT(2)              /*!< non-zero-length status OUT handshake */
#define DCFG_DS     BITS(0, 1)           /*!< device speed */

/* device control registers bits definitions */
#define DCTL_L1RJCT BIT(18)             /*!< deep sleep reject */
#define DCTL_POIF   BIT(11)             /*!< power-on initialization finished */
#define DCTL_CGONAK BIT(10)             /*!< clear global OUT NAK */
#define DCTL_SGONAK BIT(9)              /*!< set global OUT NAK */
#define DCTL_CGINAK BIT(8)              /*!< clear global IN NAK */
#define DCTL_SGINAK BIT(7)              /*!< set global IN NAK */
#define DCTL_DTEST  BITS(4, 6)           /*!< device test control */
#define DCTL_GONS   BIT(3)              /*!< global OUT NAK status */
#define DCTL_GINS   BIT(2)              /*!< global IN NAK status */
#define DCTL_SD     BIT(1)              /*!< soft disconnect */
#define DCTL_RWKUP  BIT(0)              /*!< remote wakeup */

/* device status registers bits definitions */
#define DSTAT_FNRSOF BITS(8, 21)          /*!< the frame number of the received SOF. */
#define DSTAT_ES     BITS(1, 2)           /*!< enumerated speed */
#define DSTAT_SPST   BIT(0)              /*!< suspend status */

/* device IN endpoint common interrupt enable registers bits definitions */
#define DIEPINTEN_NAKEN     BIT(13)             /*!< NAK handshake sent by USBHS interrupt enable bit */
#define DIEPINTEN_TXFEEN    BIT(7)              /*!< transmit FIFO empty interrupt enable bit */
#define DIEPINTEN_IEPNEEN   BIT(6)              /*!< IN endpoint NAK effective interrupt enable bit */
#define DIEPINTEN_EPTXFUDEN BIT(4)              /*!< endpoint Tx FIFO underrun interrupt enable bit */
#define DIEPINTEN_CITOEN    BIT(3)              /*!< control In Timeout interrupt enable bit */
#define DIEPINTEN_EPDISEN   BIT(1)              /*!< endpoint disabled interrupt enable bit */
#define DIEPINTEN_TFEN      BIT(0)              /*!< transfer finished interrupt enable bit */

/* device OUT endpoint common interrupt enable registers bits definitions */
#define DOEPINTEN_NYETEN     BIT(14)             /*!< NYET handshake is sent interrupt enable bit */
#define DOEPINTEN_BTBSTPEN   BIT(6)              /*!< back-to-back SETUP packets interrupt enable bit */
#define DOEPINTEN_EPRXFOVREN BIT(4)              /*!< endpoint Rx FIFO overrun interrupt enable bit */
#define DOEPINTEN_STPFEN     BIT(3)              /*!< SETUP phase finished interrupt enable bit */
#define DOEPINTEN_EPDISEN    BIT(1)              /*!< endpoint disabled interrupt enable bit */
#define DOEPINTEN_TFEN       BIT(0)              /*!< transfer finished interrupt enable bit */

/* device all endpoints interrupt registers bits definitions */
#define DAEPINT_OEPITB BITS(16, 23)         /*!< device all OUT endpoint interrupt bits */
#define DAEPINT_IEPITB BITS(0, 7)           /*!< device all IN endpoint interrupt bits */

/* device all endpoints interrupt enable registers bits definitions */
#define DAEPINTEN_OEPIE BITS(16, 23)         /*!< OUT endpoint interrupt enable */
#define DAEPINTEN_IEPIE BITS(0, 7)           /*!< IN endpoint interrupt enable */

/* device VBUS discharge time registers bits definitions */
#define DVBUSDT_DVBUSDT BITS(0, 15)          /*!< device VBUS discharge time */

/* device VBUS pulsing time registers bits definitions */
#define DVBUSPT_DVBUSPT BITS(0, 11)          /*!< device VBUS pulsing time */

/* device IN endpoint FIFO empty interrupt enable register bits definitions */
#define DIEPFEINTEN_IEPTXFEIE BITS(0, 5)           /*!< IN endpoint Tx FIFO empty interrupt enable bits */

/* device endpoint 0 control register bits definitions */
#define DEP0CTL_EPEN    BIT(31)             /*!< endpoint enable */
#define DEP0CTL_EPD     BIT(30)             /*!< endpoint disable */
#define DEP0CTL_SNAK    BIT(27)             /*!< set NAK */
#define DEP0CTL_CNAK    BIT(26)             /*!< clear NAK */
#define DIEP0CTL_TXFNUM BITS(22, 25)         /*!< tx FIFO number */
#define DEP0CTL_STALL   BIT(21)             /*!< STALL handshake */
#define DOEP0CTL_SNOOP  BIT(20)             /*!< snoop mode */
#define DEP0CTL_EPTYPE  BITS(18, 19)         /*!< endpoint type */
#define DEP0CTL_NAKS    BIT(17)             /*!< NAK status */
#define DEP0CTL_EPACT   BIT(15)             /*!< endpoint active */
#define DEP0CTL_MPL     BITS(0, 1)           /*!< maximum packet length */

/* device endpoint x control register bits definitions */
#define DEPCTL_EPEN    BIT(31)             /*!< endpoint enable */
#define DEPCTL_EPD     BIT(30)             /*!< endpoint disable */
#define DEPCTL_SODDFRM BIT(29)             /*!< set odd frame */
#define DEPCTL_SD1PID  BIT(29)             /*!< set DATA1 PID */
#define DEPCTL_SEVNFRM BIT(28)             /*!< set even frame */
#define DEPCTL_SD0PID  BIT(28)             /*!< set DATA0 PID */
#define DEPCTL_SNAK    BIT(27)             /*!< set NAK */
#define DEPCTL_CNAK    BIT(26)             /*!< clear NAK */
#define DIEPCTL_TXFNUM BITS(22, 25)         /*!< tx FIFO number */
#define DEPCTL_STALL   BIT(21)             /*!< STALL handshake */
#define DOEPCTL_SNOOP  BIT(20)             /*!< snoop mode */
#define DEPCTL_EPTYPE  BITS(18, 19)         /*!< endpoint type */
#define DEPCTL_NAKS    BIT(17)             /*!< NAK status */
#define DEPCTL_EOFRM   BIT(16)             /*!< even/odd frame */
#define DEPCTL_DPID    BIT(16)             /*!< endpoint data PID */
#define DEPCTL_EPACT   BIT(15)             /*!< endpoint active */
#define DEPCTL_MPL     BITS(0, 10)          /*!< maximum packet length */

/* device IN endpoint-x interrupt flag register bits definitions */
#define DIEPINTF_NAK     BIT(13)             /*!< NAK handshake sent by USBHS */
#define DIEPINTF_TXFE    BIT(7)              /*!< transmit FIFO empty */
#define DIEPINTF_IEPNE   BIT(6)              /*!< IN endpoint NAK effective */
#define DIEPINTF_EPTXFUD BIT(4)              /*!< endpoint Tx FIFO underrun */
#define DIEPINTF_CITO    BIT(3)              /*!< control In Timeout interrupt */
#define DIEPINTF_EPDIS   BIT(1)              /*!< endpoint disabled */
#define DIEPINTF_TF      BIT(0)              /*!< transfer finished */

