RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
/* device OUT endpoint-x interrupt flag register bits definitions */
#define DOEPINTF_NYET     BIT(14)             /*!< NYET handshake is sent */
#define DOEPINTF_BTBSTP   BIT(6)              /*!< back-to-back SETUP packets */
#define DOEPINTF_EPRXFOVR BIT(4)              /*!< endpoint Rx FIFO overrun */
#define DOEPINTF_STPF     BIT(3)              /*!< SETUP phase finished */
#define DOEPINTF_EPDIS    BIT(1)              /*!< endpoint disabled */
#define DOEPINTF_TF       BIT(0)              /*!< transfer finished */

/* device IN endpoint 0 transfer length register bits definitions */
#define DIEP0LEN_PCNT BITS(19, 20)         /*!< packet count */
#define DIEP0LEN_TLEN BITS(0, 6)           /*!< transfer length */

/* device OUT endpoint 0 transfer length register bits definitions */
#define DOEP0LEN_STPCNT BITS(29, 30)         /*!< SETUP packet count */
#define DOEP0LEN_PCNT   BIT(19)             /*!< packet count */
#define DOEP0LEN_TLEN   BITS(0, 6)           /*!< transfer length */

/* device OUT endpoint-x transfer length register bits definitions */
#define DOEPLEN_RXDPID BITS(29, 30)         /*!< received data PID */
#define DOEPLEN_STPCNT BITS(29, 30)         /*!< SETUP packet count */
#define DIEPLEN_MCNT   BITS(29, 30)         /*!< multi count */
#define DEPLEN_PCNT    BITS(19, 28)         /*!< packet count */
#define DEPLEN_TLEN    BITS(0, 18)          /*!< transfer length */

/* device IN endpoint-x DMA address register bits definitions */
#define DIEPDMAADDR_DMAADDR BITS(0, 31)          /*!< DMA address */

/* device OUT endpoint-x DMA address register bits definitions */
#define DOEPDMAADDR_DMAADDR BITS(0, 31)          /*!< DMA address */

/* device IN endpoint-x transmit FIFO status register bits definitions */
#define DIEPTFSTAT_IEPTFS BITS(0, 15)          /*!< IN endpoint Tx FIFO space remaining */

/* USB power and clock registers bits definition */
#define PWRCLKCTL_DSLEEP BIT(7)              /*!< PHY is in deep sleep status */
#define PWRCLKCTL_SSLEEP BIT(6)              /*!< PHY is in shallow sleep status */
#define PWRCLKCTL_SCGEN  BIT(5)              /*!< When this bit is set, the internal clock gating is enabled */
#define PWRCLKCTL_SUSP   BIT(4)              /*!< PHY is in suspend status */
#define PWRCLKCTL_SHCLK  BIT(1)              /*!< stop HCLK */
#define PWRCLKCTL_SUCLK  BIT(0)              /*!< stop the USB clock */

#define RSTAT_GOUT_NAK   1U            /*!< global OUT NAK (triggers an interrupt) */
#define RSTAT_DATA_UPDT  2U            /*!< OUT data packet received */
#define RSTAT_XFER_COMP  3U            /*!< OUT transfer completed (triggers an interrupt) */
#define RSTAT_SETUP_COMP 4U            /*!< SETUP transaction completed (triggers an interrupt) */
#define RSTAT_SETUP_UPDT 6U            /*!< SETUP data packet received */

#define DSTAT_EM_HS_PHY_30MHZ_60MHZ 0U            /*!< USB enumerate speed use high-speed PHY clock in 30MHz or 60MHz */
#define DSTAT_EM_FS_PHY_30MHZ_60MHZ 1U            /*!< USB enumerate speed use full-speed PHY clock in 30MHz or 60MHz */
#define DSTAT_EM_LS_PHY_6MHZ        2U            /*!< USB enumerate speed use low-speed PHY clock in 6MHz */
#define DSTAT_EM_FS_PHY_48MHZ       3U            /*!< USB enumerate speed use full-speed PHY clock in 48MHz */

#define DPID_DATA0 0U            /*!< device endpoint data PID is DATA0 */
#define DPID_DATA1 2U            /*!< device endpoint data PID is DATA1 */
#define DPID_DATA2 1U            /*!< device endpoint data PID is DATA2 */
#define DPID_MDATA 3U            /*!< device endpoint data PID is MDATA */

#define GAHBCS_DMAINCR(regval) (GAHBCS_BURST & ((regval) << 1U))     /*!< AHB burst type used by DMA */

#define DMA_INCR0  GAHBCS_DMAINCR(0U)                    /*!< single burst type used by DMA*/
#define DMA_INCR1  GAHBCS_DMAINCR(1U)                    /*!< 4-beat incrementing burst type used by DMA */
#define DMA_INCR4  GAHBCS_DMAINCR(3U)                    /*!< 8-beat incrementing burst type used by DMA */
#define DMA_INCR8  GAHBCS_DMAINCR(5U)                    /*!< 16-beat incrementing burst type used by DMA */
#define DMA_INCR16 GAHBCS_DMAINCR(7U)                    /*!< 32-beat incrementing burst type used by DMA */

#define DCFG_PFRI(regval) (DCFG_EOPFT & ((regval) << 11U))      /*!< end of periodic frame time configuration */

#define FRAME_INTERVAL_80 DCFG_PFRI(0U)                         /*!< 80% of the frame time */
#define FRAME_INTERVAL_85 DCFG_PFRI(1U)                         /*!< 85% of the frame time */
#define FRAME_INTERVAL_90 DCFG_PFRI(2U)                         /*!< 90% of the frame time */
#define FRAME_INTERVAL_95 DCFG_PFRI(3U)                         /*!< 95% of the frame time */

#define DCFG_DEVSPEED(regval) (DCFG_DS & ((regval) << 0U))          /*!< device speed configuration */

#define USB_SPEED_INP_HIGH DCFG_DEVSPEED(0U)                     /*!< device internal PHY high speed */
#define USB_SPEED_INP_FULL DCFG_DEVSPEED(1U)                     /*!< device internal PHY full speed */

#define DEP0_MPL(regval) (DEP0CTL_MPL & ((regval) << 0U))      /*!< maximum packet length configuration */

#define EP0MPL_64 DEP0_MPL(0U)                          /*!< maximum packet length 64 bytes */
#define EP0MPL_32 DEP0_MPL(1U)                          /*!< maximum packet length 32 bytes */
#define EP0MPL_16 DEP0_MPL(2U)                          /*!< maximum packet length 16 bytes */
#define EP0MPL_8  DEP0_MPL(3U)                          /*!< maximum packet length 8 bytes */

#define DOEP0_TLEN(regval)   (DOEP0LEN_TLEN & ((regval) << 0U))    /*!< Transfer length */
#define DOEP0_PCNT(regval)   (DOEP0LEN_PCNT & ((regval) << 19U))   /*!< Packet count */
#define DOEP0_STPCNT(regval) (DOEP0LEN_STPCNT & ((regval) << 29U)) /*!< SETUP packet count */

#define GRXSTS_PKTSTS_IN              2U
#define GRXSTS_PKTSTS_IN_XFER_COMP    3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR 5U
#define GRXSTS_PKTSTS_CH_HALTED       7U

#define DEVICE_MODE 0U                      /*!< device mode */
#define HOST_MODE   1U                      /*!< host mode */
#define OTG_MODE    2U                      /*!< OTG mode */

#define HCTL_30_60MHZ 0U                      /*!< USB clock 30-60MHZ */
#define HCTL_48MHZ    1U                      /*!< USB clock 48MHZ */
#define HCTL_6MHZ     2U                      /*!< USB clock 6MHZ */

#define USBHS_MAX_PACKET_SIZE   512U                    /*!< USBHS max packet size */
#define USBHS_MAX_CHANNEL_COUNT 16U                     /*!< USBHS host channel count */
#define USBHS_MAX_EP_COUNT      8U                      /*!< USBHS device endpoint count */
#define USBHS_MAX_FIFO_WORDLEN  1280U                   /*!< USBHS max fifo size in words */

#define USB_DATA_FIFO_OFFSET 0x1000U                 /*!< USB data fifo offset */
#define USB_DATA_FIFO_SIZE   0x1000U                 /*!< USB data fifo size */

