RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/usb/drv_usb_regs.h
typedef enum
{
    USB_EMBEDDED_PHY_FS = 0U,                                           /*!< USB embedded FS PHY */
    USB_EMBEDDED_PHY_HS,                                                /*!< USB embedded HS PHY */
    USB_ULPI_PHY_EXTERNAL                                               /*!< USB external ULPI PHY */
} usb_phy_enum;

enum usb_reg_offset
{
    USB_REG_OFFSET_CORE = 0x0000U,                                 /*!< global OTG control and status register */
    USB_REG_OFFSET_DEV = 0x0800U,                                 /*!< device mode control and status registers */
    USB_REG_OFFSET_EP = 0x0020U,                                 /*!< offset of each endpoint */
    USB_REG_OFFSET_EP_IN = 0x0900U,                                 /*!< device IN endpoint 0 control register */
    USB_REG_OFFSET_EP_OUT = 0x0B00U,                                 /*!< device OUT endpoint 0 control register */
    USB_REG_OFFSET_HOST = 0x0400U,                                 /*!< host control register */
    USB_REG_OFFSET_CH = 0x0020U,                                 /*!< offset of each channel */
    USB_REG_OFFSET_PORT = 0x0440U,                                 /*!< host port control and status register */
    USB_REG_OFFSET_CH_INOUT = 0x0500U,                                 /*!< host channel-x control registers */
    USB_REG_OFFSET_PWRCLKCTL = 0x0E00U                                  /*!< power and clock register */
};

enum USB_SPEED
{
    USB_SPEED_UNKNOWN = 0,                                              /*!< USB speed unknown */
    USB_SPEED_LOW,                                                      /*!< USB speed low */
    USB_SPEED_FULL,                                                     /*!< USB speed full */
    USB_SPEED_HIGH                                                      /*!< USB speed high */
};

#define EP0_OUT ((uint8_t)0x00U)        /*!< endpoint out 0 */
#define EP0_IN  ((uint8_t)0x80U)        /*!< endpoint in 0 */
#define EP1_OUT ((uint8_t)0x01U)        /*!< endpoint out 1 */
#define EP1_IN  ((uint8_t)0x81U)        /*!< endpoint in 1 */
#define EP2_OUT ((uint8_t)0x02U)        /*!< endpoint out 2 */
#define EP2_IN  ((uint8_t)0x82U)        /*!< endpoint in 2 */
#define EP3_OUT ((uint8_t)0x03U)        /*!< endpoint out 3 */
#define EP3_IN  ((uint8_t)0x83U)        /*!< endpoint in 3 */
#define EP4_OUT ((uint8_t)0x04U)        /*!< endpoint out 4 */
#define EP4_IN  ((uint8_t)0x84U)        /*!< endpoint in 4 */
#define EP5_OUT ((uint8_t)0x05U)        /*!< endpoint out 5 */
#define EP5_IN  ((uint8_t)0x85U)        /*!< endpoint in 5 */
#define EP6_OUT ((uint8_t)0x06U)        /*!< endpoint out 6 */
#define EP6_IN  ((uint8_t)0x86U)        /*!< endpoint in 6 */
#define EP7_OUT ((uint8_t)0x06U)        /*!< endpoint out 7 */
#define EP7_IN  ((uint8_t)0x86U)        /*!< endpoint in 7 */

#endif /* DRV_USB_REGS_H */
